Revit 2024 API
ParameterTypeId.ConstraintFixedOffset Property
 "Fixed offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ConstraintFixedOffset { get; }
Visual Basic
Public Shared ReadOnly Property ConstraintFixedOffset As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ConstraintFixedOffset {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace